// Javascript tasks

// task 1 ------------------------------------------------------------------------->

// 1. შექმენით ფუნქცია სადაც პარამეტრები გვექნება მასივი და სტინგი.
// მასივში უნდა იყოს სტუდენტების სახელები, და სტინგში მხოლოდ ერთი სტუდენტის.
// ფუნქციამ უნდა შეამოწმოს მასივში არის თუ არა ეს სტუდენტი და დააბრუნოს:
// სტუდენტი სწავლობს, თუ არ არის უნდა დააბრუნოს ასეთი სტუდენტი ვერ მოიძებნა

// function StudentFinder(students, studentName) {
//   return students.includes(studentName)
//     ? `${studentName} სწავლობს ჩვენთან`
//     : `ასეთი სტუდენტი ვერ მოიძებნა`;
// }

// console.log(
//   StudentFinder(["tarieli", "tkbileula", "lomisasuli", "vardena"], "kanibala")
// );

// task 2 ------------------------------------------------------------------------->

// 2. 🐉 FizzBuzz 🐉
// ვქმნით ფუნქციას სახელად FizzBuzz, ფუნქციას გადაეწოდება სამი პარამეტრი, ესენია: საწყისი რიცხვი, საბოლოვო რიცხვი და მიმართულების აღმნიშნელი,
// მაგალითად მომხმარებელმა შეიყვანა საწყის რიცხვად 1 ხოლო საბოლოვო რიცხვად 30, და მიმათულების აღმნიშნელად პლიუსი, ეს რიცხვები კონსოლშ უნდა დაილოგოს 1 დან 30 ის ჩათვლით ზრდადობით, თუ
// მომხმარებელმა მინუსი შეიყვანა მაშინ რიცხვები ილოგება კლებადობით,
// ⚠️ მაგრამ ⚠️ ისეთი რიცხვი რომელიც იყოფა სამზე კონსოლში რიცხვის მაგივრად უნდა გამოვიდეს Fizz,
// რიცხვი რომელიც იყოფა 5 ზე კონსოლში რიცხვის მაგივრად უნდა გამოვიდეს Buzz,
// და რიცხვი რომელიც იყოფა როგორც 3 ასევე 5 ზე, კონსოლში უნდა გამოვიდეს FizzBuzz

// ⚠️ მომხმარებელს თვითონ უნდა შეეძლოს რიცხვის შეყვანა, ასევე მიმართულების აღმნიშვნელის ან პლიუსის ან მინუსის რომელიც უზრუნველყოფს თუ როგორ დაილოგოს რიცხვები ზრდადობით თუ კლებადობით ⚠️

// ⚠️ თუ მომხმარებელი რიცხვის მაგივრად შეიყვანს სტრინგს, თავიდან უნდა ამოუგდოს შესაყვანი ფრომპთი, გთხოვთ შეიყვანეთ საწყისი რიცხვი, მანამ სანამ მომხმარებელი არ შეიყვანს რიცხვს უნდა ამოვარდეს ერთი და
// იგივე შესაყვანი ველი, როგორც კი რიცხვს შეიყვანს საწყის უნდა ამოვარდეს მეორე შესაყვანი ველი სადაც ანალოგიურად უნდა შეიყვანოს საბოლოვო რიცხვი, იგივე ლოგიკით მხოლოდ რიცხვის შეყვანა შეეძლოს, და მესამე
//  მიმართულების შესაყვან ველში უნდა შეეძლოს მხოლოდ + ან - ის შეყვანა სხვა შემთხვევაში ხელახლა ამოუგდებს, იგივე ტექსტით რომ შეიყვანოს პლიუსი ან მინუსი.

const FizzBuzz = (firstNumber, lastNumber, direction) => {
  if (typeof firstNumber !== "number") {
    return console.log("გთხოვთ შეიყვანეთ საწყისი რიცხვი");
  }
  if (typeof lastNumber !== "number") {
    return console.log("გთხოვთ შეიყვანოთ საბოლოო რიცხვი");
  }
  if (direction != "-" && direction != "+") {
    return console.log("გთხოვთ შეიყვანოთ + ან -");
  }

  let numbers = [];
  for (var i = firstNumber; i < lastNumber; i++) {
    numbers.push(i);
  }

  direction === "-"
    ? numbers.sort((a, b) => b - a)
    : numbers.sort((a, b) => a - b);

  for (let i of numbers) {
    if (i % 3 === 0 && i % 5 === 0) {
      console.log(i + " fizzbuzz");
    } else if (i % 3 === 0) {
      console.log(i + " fizz");
    } else if (i % 5 === 0) {
      console.log(i + " buzz");
    } else {
      console.log(i);
    }
  }
};

console.log(FizzBuzz(3, 12, "-"));
